; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   orange_block_1 yellow_block_1 black_block_1 black_block_2 white_block_1 red_block_1 blue_block_1 - block
 )
 (:init (ontable orange_block_1) (on yellow_block_1 orange_block_1) (on black_block_1 yellow_block_1) (ontable black_block_2) (ontable white_block_1) (on red_block_1 white_block_1) (on blue_block_1 black_block_2) (clear black_block_1) (clear red_block_1) (clear blue_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (holding blue_block_1)))
 (:constraints (sometime (not (clear blue_block_1))) (sometime-before (not (clear blue_block_1)) (ontable red_block_1)) (sometime (clear yellow_block_1)) (sometime (on red_block_1 orange_block_1)) (sometime (ontable yellow_block_1)) (sometime (not (on blue_block_1 white_block_1))) (sometime-after (not (on blue_block_1 white_block_1)) (clear yellow_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack red_block_1 white_block_1)
   deleted: (on red_block_1 white_block_1) (clear red_block_1) (handempty)
   added: (holding red_block_1) (clear white_block_1)
   goals met: 0 of 1
2. (putdown red_block_1)
   deleted: (holding red_block_1)
   added: (clear red_block_1) (handempty) (ontable red_block_1)
   goals met: 0 of 1
3. (unstack black_block_1 yellow_block_1)
   deleted: (on black_block_1 yellow_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear yellow_block_1)
   goals met: 0 of 1
4. (stack black_block_1 blue_block_1)
   deleted: (clear blue_block_1) (holding black_block_1)
   added: (handempty) (clear black_block_1) (on black_block_1 blue_block_1)
   goals met: 0 of 1
5. (unstack yellow_block_1 orange_block_1)
   deleted: (on yellow_block_1 orange_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear orange_block_1)
   goals met: 0 of 1
6. (putdown yellow_block_1)
   deleted: (holding yellow_block_1)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1)
   goals met: 0 of 1
7. (pickup red_block_1)
   deleted: (clear red_block_1) (ontable red_block_1) (handempty)
   added: (holding red_block_1)
   goals met: 0 of 1
8. (stack red_block_1 orange_block_1)
   deleted: (clear orange_block_1) (holding red_block_1)
   added: (handempty) (clear red_block_1) (on red_block_1 orange_block_1)
   goals met: 0 of 1
9. (unstack black_block_1 blue_block_1)
   deleted: (on black_block_1 blue_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear blue_block_1)
   goals met: 0 of 1
10. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1)
   goals met: 0 of 1
11. (unstack blue_block_1 black_block_2)
   deleted: (on blue_block_1 black_block_2) (clear blue_block_1) (handempty)
   added: (holding blue_block_1) (clear black_block_2)
   goals met: 1 of 1
